---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.ClosedLoop
source: html/cf40396b-5555-36af-50b7-0897dc8e4a44.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.ClosedLoop Property

GridChain sketch contains a closed loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId ClosedLoop { get; }
```